RobertoBenjami/stm32_ps2/Drivers/ps2.c
/* PS/2 keyboard and mouse interface driver
   author: Roberto Benjami
   version: 2020.11.02
*/

#include <stdint.h>
#include "main.h"
#include "ps2.h"
#include "ps2_codepage.h"

#if defined(STM32F0)
#include "ps2_stm32f0xx.h"
#elif defined(STM32F1)
#include "ps2_stm32f1xx.h"
#elif defined(STM32F2)
#include "ps2_stm32f2xx.h"
#elif defined(STM32F3)
#include "ps2_stm32f3xx.h"
#elif defined(STM32F4)
#include "ps2_stm32f4xx.h"
#elif defined(STM32F7)
#include "ps2_stm32f7xx.h"
#elif defined(STM32H7)
#include "ps2_stm32h7xx.h"
#elif defined(STM32G0)
#include "ps2_stm32g0xx.h"
#elif defined(STM32G4)
#include "ps2_stm32g0xx.h"
#elif defined(STM32L0)
#include "ps2_stm32l0xx.h"
#elif defined(STM32L1)
#include "ps2_stm32l1xx.h"
#elif defined(STM32L4)
#include "ps2_stm32l4xx.h"
#elif defined(STM32L5)
#include "ps2_stm32l5xx.h"
#else
#error unknown processor family
#endif

/* - no printf debug: 0
   - printf debug:    1 */
#define PS2_DEBUG               0

/* Ext and TIM interrupt priority (if we don't want to define it -> -1) */
#define PS2_KBD_EXT_IRQ_PR     -1
#define PS2_MOUSE_EXT_IRQ_PR   -1
#define PS2_TIM_IRQn_PR        -1

/* start clock impulse (microsecond) */
#define PS2_STARTIMPULSEWIDTH 800

/* timeout constans (millisecond) */
#define PS2_MOUSE_RESETTIME   750
#define PS2_MOUSE_IDTIME       10
#define PS2_MOUSE_RATETIME     10
#define PS2_MOUSE_READTIME     20

//-----------------------------------------------------------------------------
#if   PS2_DEBUG == 0
#define  ps2_printf(args...)
#elif PS2_DEBUG == 1
#define  ps2_printf(args...)  printf(args)
#endif

//-----------------------------------------------------------------------------
/* if the pin not definied */
#ifndef PS2_KBDCLK
#define PS2_KBDCLK            X, 0
#endif
#ifndef PS2_KBDDATA
#define PS2_KBDDATA           X, 0
#endif
#ifndef PS2_MOUSECLK
#define PS2_MOUSECLK          X, 0
#endif
#ifndef PS2_MOUSEDATA
#define PS2_MOUSEDATA         X, 0
#endif

//-----------------------------------------------------------------------------
/* Keyboard config */
#if (GPIOX_PORTNUM(PS2_KBDCLK) >= GPIOX_PORTNUM_A) && (GPIOX_PORTNUM(PS2_KBDDATA) >= GPIOX_PORTNUM_A)

#if KBDRBUF_SIZE < 8
#error KBDRBUF SIZE too small
#elif ((KBDRBUF_SIZE & (KBDRBUF_SIZE-1)) != 0)
#error KBDRBUF SIZE is not equal to 2 ^ n
#endif

#if KBDTBUF_SIZE < 8
#error KBDTBUF SIZE too small
#elif ((KBDTBUF_SIZE & (KBDTBUF_SIZE-1)) != 0)
#error KBDTBUF SIZE is not equal to 2 ^ n
#endif

#endif

// ----------------------------------------------------------------------------
/* Mouse config */
#if (GPIOX_PORTNUM(PS2_MOUSECLK) >= GPIOX_PORTNUM_A) && (GPIOX_PORTNUM(PS2_MOUSEDATA) >= GPIOX_PORTNUM_A)

#if MOUSERBUF_SIZE < 8
#error MOUSERBUF SIZE too small
#elif ((MOUSERBUF_SIZE & (MOUSERBUF_SIZE-1)) != 0)
#error MOUSERBUF SIZE is not equal to 2 ^ n
#endif

#if MOUSETBUF_SIZE < 8
#error MOUSETBUF SIZE too small
#elif ((MOUSETBUF_SIZE & (MOUSETBUF_SIZE-1)) != 0)
#error MOUSETBUF SIZE is not equal to 2 ^ n
#endif

#endif

// ----------------------------------------------------------------------------
/* Keyboard + Mouse */
#if (PS2_KBD_EXT_N >= 1) && (PS2_MOUSE_EXT_N >= 1)

#if (GPIOX_PIN(PS2_KBDCLK) == GPIOX_PIN(PS2_MOUSECLK))
#error "The keyboard and mouse CLK pin not possible in on the same pin number!"
#endif

#if PS2_KBD_EXT_N == PS2_MOUSE_EXT_N
#define PS2_KBD_MOUSE_COMMON_EXT_IRQ
#endif

#define PS2_TIM_VAR      uint8_t timermode
#define PS2_TIM_OFF      ps2s->timermode = 0
#define PS2_TIM_ON       ps2s->timermode = 1
#define PS2_KBDTIM_OFF   kbd.timermode = 0
#define PS2_KBDTIM_ON    kbd.timermode = 1
#define PS2_MOUSETIM_OFF mouse.timermode = 0
#define PS2_MOUSETIM_ON  mouse.timermode = 1

#else
/* Only keyboard or only mouse */

#define PS2_TIM_VAR
#define PS2_TIM_OFF
#define PS2_TIM_ON
#define PS2_KBDTIM_OFF
#define PS2_KBDTIM_ON
#define PS2_MOUSETIM_OFF
#define PS2_MOUSETIM_ON

#endif

void ps2_init(void);

// ============================================================================
/* PS2 status */
typedef enum
{
  PASSIVE = 0,  /* no sending, no receiving */
  REC,          /* receiving */
  SENDSTART,    /* start of sending */
  SEND,         /* sending */
  POST          /* end of sending or receiving */
} s_ps2s;

typedef struct
{
  void              (*cb_rx)(uint8_t);  /* rx fifo write */
  uint8_t           (*cb_tx)(uint8_t *);/* tx fifo read */
  volatile s_ps2s   status;             /* ps2 status */
  GPIO_TypeDef *    clockport;          /* clock pin GPIO address */
  GPIO_TypeDef *    dataport;           /* data pin GPIO address */
  uint16_t          clockpinmask;       /* clock pin GPIO bitmask for BSRR, IDR */
  uint16_t          datapinmask;        /* data pin GPIO bitmask for BSRR, IDR */
  uint8_t           bitcount;
  uint8_t           data;
  uint8_t           databit;
  uint8_t           error;
  uint8_t           parity;
  PS2_TIM_VAR;                          /* 0: timer interrupt is not active, 1: active */
} t_Ps2;

#define FIFO_LEN(buf)                   (buf.in - buf.out)
#define FIFO_EMPTY(buf)                 (buf.in == buf.out)
#define FIFO_NOTEMPTY(buf)              (buf.in != buf.out)
#define FIFO_FULL(buf, bufsize)         (((buf.in - buf.out) & ~(bufsize - 1)) != 0)
#define FIFO_NOTFULL(buf, bufsize)      (((buf.in - buf.out) & ~(bufsize - 1)) == 0)
#define FIFO_WRITE(buf, bufsize, wd8)   buf.data[buf.in++ & (bufsize - 1)] = wd8
#define FIFO_READ(buf, bufsize, rd8)    rd8 = buf.data[buf.out++ & (bufsize - 1)]


// ----------------------------------------------------------------------------
uint8_t ps2_inited = 0;                 /* 0: not intited (must be called the ps2_init), 1: after init */

inline void ps2_initcheck(void)
{
  if(!ps2_inited)
  {
    ps2_init();
    ps2_inited = 1;
  }
}

// ============================================================================
/* Keyboard */
#if  PS2_KBD_EXT_N >= 1

volatile uint8_t  ps2_kbdlockstatus;    /* the lock and led bits: 0,0,0,0,0,capslock,numlock,scrollock */
volatile uint8_t  ps2_kbdctrlstatus;

void     cb_ps2_kbdrx(uint8_t rxdata);
uint8_t  cb_ps2_kbdtx(uint8_t * txdata);

