RobertoBenjami/stm32_ps2/Drivers/ps2.c
struct kbdbuf_r
{
  uint32_t in;                /* Next In Index */
  uint32_t out;               /* Next Out Index */
  char data[KBDRBUF_SIZE];    /* Buffer data */
};

struct kbdbuf_t
{
  uint32_t in;                /* Next In Index */
  uint32_t out;               /* Next Out Index */
  char data[KBDTBUF_SIZE];    /* Buffer data */
};

static struct kbdbuf_r kbdrbuf = {0, 0,};
static struct kbdbuf_t kbdtbuf = {0, 0,};

t_Ps2   kbd = {cb_ps2_kbdrx, cb_ps2_kbdtx, 0, 0, 0, 0, PASSIVE};

__weak  void ps2_kbd_cbrxof(void) { }

// ----------------------------------------------------------------------------
uint8_t ps2_kbd_datawrite(uint8_t kbd_data)
{
  if(FIFO_FULL(kbdtbuf, KBDTBUF_SIZE))
    return 0;

  FIFO_WRITE(kbdtbuf, KBDTBUF_SIZE, kbd_data);   /* Add data to the transmit buffer. */
  ps2_printf("kt:%X\r\n", (unsigned int)kbd_data);

  if(kbd.status == PASSIVE)
  { /* can I send now? */
    GPIOX_CLR(PS2_KBDCLK);              /* CLK = 0 */
    TIM_RESTART;
    PS2_KBDTIM_ON;                      /* Timer active */
    kbd.status = SENDSTART;
    ps2_printf("kts\r\n");
  }
  return 1;
}

// ----------------------------------------------------------------------------
uint8_t ps2_kbd_dataread(uint8_t * kbd_data)
{
  if(FIFO_NOTEMPTY(kbdrbuf))
  { /* not empty */
    FIFO_READ(kbdrbuf, KBDRBUF_SIZE, *kbd_data);
    ps2_printf("kr:%X\r\n", (unsigned int)*kbd_data);
    return 1;
  }
  else
  { /* empty */
    return 0;
  }
}

// ----------------------------------------------------------------------------
/* PS2 keyboard tx data get from tx fifo buffer (if txdata == NULL -> only tx buffer data info) */
uint8_t cb_ps2_kbdtx(uint8_t * txdata)
{
  if(FIFO_NOTEMPTY(kbdtbuf))
  {
    if(txdata)
    {
      FIFO_READ(kbdtbuf, KBDTBUF_SIZE, *txdata);
      ps2_printf("kct:%X\r\n", (unsigned int)*txdata);
    }
    return 1;
  }
  else
    return 0;
}

// ----------------------------------------------------------------------------
/* PS2 keyboard rx data store to rx fifo buffer */
void cb_ps2_kbdrx(uint8_t rxdata)
{
  static uint8_t predata = 0;

  if(FIFO_NOTFULL(kbdrbuf, KBDRBUF_SIZE))
  {
    FIFO_WRITE(kbdrbuf, KBDRBUF_SIZE, rxdata);
    ps2_printf("kcr:%X\r\n", (unsigned int)rxdata);
  }
  else
  {
    ps2_kbd_cbrxof();
    ps2_printf("kcr:full!!\r\n");
  }

  if((predata != 0xF0) && (rxdata != 0xFA))
  { /* LED change */
    if(rxdata == SCN_CAPSLOCK)
    { /* capslock */
      ps2_kbdlockstatus ^= ST_KBDCAPSLOCK;
    }
    else if(rxdata == SCN_NUMLOCK)
    { /* numlock */
      ps2_kbdlockstatus ^= ST_KBDNUMLOCK;
    }
    else if(rxdata == SCN_SCRLOCK)
    { /* scrlock */
      ps2_kbdlockstatus ^= ST_KBDSCRLOCK;
    }
    else
    {
      predata = rxdata;
      return;
    }
    ps2_printf("klock:%X\r\n", (unsigned int)ps2_kbdlockstatus);
    ps2_kbd_datawrite(0xED);
    ps2_kbd_datawrite(ps2_kbdlockstatus);
  }
  predata = rxdata;
}


// ----------------------------------------------------------------------------
/* low level ps2 keyboard init */
static inline void ps2_kbdinit(void)
{
  GPIOX_SET(PS2_KBDCLK);                /* CLK = 1 */
  GPIOX_ODOUT(PS2_KBDCLK);              /* CLK = OD out */

  GPIOX_SET(PS2_KBDDATA);               /* DATA = 1 */
  GPIOX_ODOUT(PS2_KBDDATA);             /* DATA = OD out */

  EXTI_INIT(PS2_KBDCLK);

  kbd.clockport = GPIOX(PS2_KBDCLK);
  kbd.dataport  = GPIOX(PS2_KBDDATA);
  kbd.clockpinmask = 1 << (GPIOX_PIN(PS2_KBDCLK));
  kbd.datapinmask = 1 << (GPIOX_PIN(PS2_KBDDATA));

  NVIC->ISER[(((uint32_t)(int32_t)PS2_KBD_EXT_IRQ) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)(int32_t)PS2_KBD_EXT_IRQ) & 0x1FUL));
  NVIC->IP[((uint32_t)(int32_t)PS2_KBD_EXT_IRQ)] = (uint8_t)((PS2_IRQPRIORITY << (8U - __NVIC_PRIO_BITS)) & (uint32_t)0xFFUL);
}

#endif  // #if  PS2_KBD_EXT_N >= 1

// ----------------------------------------------------------------------------
/* mouse low level */
#if  PS2_MOUSE_EXT_N >= 1

struct mousebuf_r
{
  volatile unsigned int in;             /* Next In Index */
  volatile unsigned int out;            /* Next Out Index */
  char data[MOUSERBUF_SIZE];            /* Buffer */
};

struct mousebuf_t
{
  volatile unsigned int in;             /* Next In Index */
  volatile unsigned int out;            /* Next Out Index */
  char data[MOUSETBUF_SIZE];            /* Buffer */
};

static struct mousebuf_r mouserbuf = {0, 0,};
static struct mousebuf_t mousetbuf = {0, 0,};

__weak  void ps2_mouse_cbrxof(void) { }

// ----------------------------------------------------------------------------
/* ps2 mouse tx data read from tx fifo buffer */
static inline uint8_t cb_ps2_mousetx(uint8_t * txdata)
{
  if(FIFO_NOTEMPTY(mousetbuf))
  { /* not empty */
    if(txdata)
    {
      FIFO_READ(mousetbuf, MOUSETBUF_SIZE, *txdata);
      ps2_printf("mct:%X\r\n", (unsigned int)*txdata);
    }
    return 1;
  }
  else
    return 0;
}

// ----------------------------------------------------------------------------
/* ps2 mouse rx data store to rx fifo buffer (callback) */
static inline void cb_ps2_mouserx(uint8_t rxdata)
{
  if(FIFO_NOTFULL(mouserbuf, MOUSERBUF_SIZE))
  {
    FIFO_WRITE(mouserbuf, MOUSERBUF_SIZE, rxdata);
    ps2_printf("mcr:%X\r\n", (unsigned int)rxdata);
  }
  else
  {
    ps2_mouse_cbrxof();
    ps2_printf("mcr:full!!\r\n");
  }
}

// ----------------------------------------------------------------------------

t_Ps2   mouse = { cb_ps2_mouserx, cb_ps2_mousetx, 0, 0, 0, 0, PASSIVE };

// ----------------------------------------------------------------------------
/* low level data read from ps2 mouse
   - param: pointer to 8 bits data
   - return: 0 = no data available, 1 = data received
   - note: if no data available -> the mouse_data does not change */
uint8_t ps2_mouse_dataread(uint8_t * mouse_data)
{
  if(FIFO_NOTEMPTY(mouserbuf))
  { /* not empty */
    FIFO_READ(mouserbuf, MOUSERBUF_SIZE, *mouse_data);
    ps2_printf("mr:%X\r\n", (unsigned int)*mouse_data);
    return 1;
  }
  else
  { /* empty */
    return 0;
  }
}

// ----------------------------------------------------------------------------
/* low level data write to ps2 mouse
   - param: 8 bits data
   - return: 0 = write buffer full, 1 = ok */
uint8_t ps2_mouse_datawrite(uint8_t mouse_data)
{
  if(FIFO_FULL(mousetbuf, MOUSETBUF_SIZE))
    return 0;

  FIFO_WRITE(mousetbuf, MOUSETBUF_SIZE, mouse_data);
  ps2_printf("mt:%X\r\n", (unsigned int)mouse_data);

