RobertoBenjami/stm32_ps2/Drivers/ps2.c
  if(mouse.status == PASSIVE)
  {                                     /* lehet most küldeni */
    GPIOX_CLR(PS2_MOUSECLK);            /* CLK = 0 */
    PS2_TIM->CNT = 0;                   /* Timer counter = 0 */
    PS2_TIM->CR1 |= TIM_CR1_CEN;
    PS2_MOUSETIM_ON;
    mouse.status = SENDSTART;
  }
  return 1;
}

// ----------------------------------------------------------------------------
/* low level ps2 mouse init */
static inline void ps2_mouseinit(void)
{
  GPIOX_SET(PS2_MOUSECLK);              /* CLK = 1 */
  GPIOX_ODOUT(PS2_MOUSECLK);
  GPIOX_SET(PS2_MOUSEDATA);             /* DATA = 1 */
  GPIOX_ODOUT(PS2_MOUSEDATA);

  EXTI_INIT(PS2_MOUSECLK);

  mouse.clockport = GPIOX(PS2_MOUSECLK);
  mouse.dataport  = GPIOX(PS2_MOUSEDATA);
  mouse.clockpinmask = 1 << (GPIOX_PIN(PS2_MOUSECLK));
  mouse.datapinmask = 1 << (GPIOX_PIN(PS2_MOUSEDATA));

  NVIC->ISER[(((uint32_t)(int32_t)PS2_MOUSE_EXT_IRQ) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)(int32_t)PS2_MOUSE_EXT_IRQ) & 0x1FUL));
  NVIC->IP[((uint32_t)(int32_t)PS2_MOUSE_EXT_IRQ)] = (uint8_t)((PS2_IRQPRIORITY << (8U - __NVIC_PRIO_BITS)) & (uint32_t)0xFFUL);
}

#endif  // if ((defined PS2_MOUSECLK) && defined PS2_MOUSEDATA))

// ============================================================================
/* common GPIO EXT interrupt (clock falling edge) */
static inline void ps2_ext_int(t_Ps2 * ps2s)
{
  /* databit = ps2 data pin */
  if(GPIOX_IDR_PS2PIN(ps2s->dataport, ps2s->datapinmask))
    ps2s->databit = 1;
  else
    ps2s->databit = 0;

  TIM_RESTART;

  ps2s->bitcount--;

  if(ps2s->status == PASSIVE)
  {                                     /* PASSIVE */
    PS2_TIM_ON;
    if(ps2s->databit == 0)
    {                                   /* PASSIVE startbit */
      ps2s->status = REC;
      ps2s->bitcount = 11;
    }
    else
      ps2s->error = 1;
    ps2s->parity = 0;
  }

  else if(ps2s->status == REC)
  {                                     /* REC */
    if(ps2s->bitcount == 2)
    {                                   /* REC parity */
      if(ps2s->databit == ps2s->parity)
        ps2s->error = 1;
    }
    else if(ps2s->bitcount == 1)
    {                                   /* REC stopbit */
      if((ps2s->databit == 1) && (ps2s->error == 0))
      {                                 /* if no error and stopbit == 1 -> scancode to rec buffer */
        ps2s->cb_rx(ps2s->data);
      }
      ps2s->error = 0;
      ps2s->parity = 0;
      ps2s->data = 0;
      ps2s->status = POST;
    }
    else
    {                                   /* REC databits */
      ps2s->data >>= 1;
      if(ps2s->databit)
      {
        ps2s->data |= 0x80;
        ps2s->parity = 1 - ps2s->parity;
      }
    }
  }

  else if(ps2s->status == SEND)
  {                                     /* SEND */
    if(ps2s->bitcount == 2)
    {                                   /* SEND parity */
      if(!ps2s->parity)
        GPIOX_SET_PS2PIN(ps2s->dataport, ps2s->datapinmask); /* DATA = 1 */
      else
        GPIOX_CLR_PS2PIN(ps2s->dataport, ps2s->datapinmask); /* DATA = 0 */
    }
    else if(ps2s->bitcount == 1)
    {                                   /* SEND stopbit */
      GPIOX_SET_PS2PIN(ps2s->dataport, ps2s->datapinmask); /* DATA = 1 */
    }
    else if(ps2s->bitcount == 0)
    {                                   /* SEND ACK */
      ps2s->data = 0;
      ps2s->bitcount = 11;
      ps2s->parity = 0;
      ps2s->error = 0;
      ps2s->status = POST;
    }
    else
    {                                   /* SEND databits */
      if(ps2s->data & 0x01)
      {
        GPIOX_SET_PS2PIN(ps2s->dataport, ps2s->datapinmask); /* DATA = 1 */
        ps2s->parity = 1 - ps2s->parity;
      }
      else
        GPIOX_CLR_PS2PIN(ps2s->dataport, ps2s->datapinmask); /* DATA = 0 */
      ps2s->data >>= 1;
    }
  }

  else if(ps2s->status == POST)
  {
    ps2s->bitcount = 11;
    ps2s->status = REC;
  }
}

// ----------------------------------------------------------------------------
static inline void ps2_timer_int(t_Ps2 * ps2s)
{
  uint8_t data8;
  if(ps2s->status == SENDSTART)
  {
    if(ps2s->cb_tx(&data8))
    {
      TIM_RESTART;                      /* timer counter reset + timer start */
      GPIOX_CLR_PS2PIN(ps2s->dataport, ps2s->datapinmask);   /* ps2 data pin = 0 */
      GPIOX_SET_PS2PIN(ps2s->clockport, ps2s->clockpinmask); /* ps2 clock pin = 1 */
      ps2s->bitcount = 11;
      ps2s->data = data8;
      ps2s->parity = 0;
      ps2s->status = SEND;
    }
    else
    {
      GPIOX_SET_PS2PIN(ps2s->dataport, ps2s->datapinmask);   /* ps2 data pin = 1 */
      GPIOX_SET_PS2PIN(ps2s->clockport, ps2s->clockpinmask); /* ps2 clock pin = 1 */
      ps2s->status = PASSIVE;
    }
  }
  else
  {
    #if 0
    if(ps2s->status == SEND)
    {
    }
    else if(ps2s->status == POST)
    {
    }
    else if(ps2s->status == REC)
    {
    }
    #endif

    GPIOX_SET_PS2PIN(ps2s->dataport, ps2s->datapinmask);  /* ps2 data pin = 1 */
    if(ps2s->cb_tx(NULL) && (GPIOX_IDR_PS2PIN(ps2s->dataport, ps2s->datapinmask)))
    {                                   /* tx buffer not empty and data pin is high */
      GPIOX_CLR_PS2PIN(ps2s->clockport, ps2s->clockpinmask); /* ps2 clock pin = 0 */
      PS2_TIM->CNT = 0;                 /* timer counter reset */
      PS2_TIM->CR1 |= TIM_CR1_CEN;
      PS2_TIM_ON;                       /* timer active */
      ps2s->status = SENDSTART;
    }
    else
    {
      GPIOX_SET_PS2PIN(ps2s->clockport, ps2s->clockpinmask); /* ps2 clock pin = 1 */
      ps2s->status = PASSIVE;
      PS2_TIM_OFF;
    }
  }
}

// ----------------------------------------------------------------------------
/* common kbd and mouse clock EXT input (falling edge) interrupt */
#if (PS2_KBD_EXT_N >= 1) && (PS2_MOUSE_EXT_N >= 1) && (PS2_KBD_EXT_N == PS2_MOUSE_EXT_N)
void PS2_KBD_EXT_IRQHandler(void)
{
  if(EXTI_GET(PS2_KBDCLK))
  {
    EXTI_CLR(PS2_KBDCLK);
    ps2_ext_int(&kbd);
  }
  if(EXTI_GET(PS2_MOUSECLK))
  {
    EXTI_CLR(PS2_MOUSECLK);
    ps2_ext_int(&mouse);
  }
}
#endif

// ----------------------------------------------------------------------------
/* keyboard clock EXT input (falling edge) interrupt */
#if (PS2_KBD_EXT_N >= 1) && (PS2_KBD_EXT_N != PS2_MOUSE_EXT_N)
void PS2_KBD_EXT_IRQHandler(void)
{
  if(EXTI_GET(PS2_KBDCLK))
  {
    EXTI_CLR(PS2_KBDCLK);
    ps2_ext_int(&kbd);
  }
}
#endif

// ----------------------------------------------------------------------------
/* mouse clock EXT input (falling edge) interrupt */
#if (PS2_MOUSE_EXT_N >= 1) && (PS2_KBD_EXT_N != PS2_MOUSE_EXT_N)
void PS2_MOUSE_EXT_IRQHandler(void)
{
  if(EXTI_GET(PS2_MOUSECLK))
  {
    EXTI_CLR(PS2_MOUSECLK);
    ps2_ext_int(&mouse);
  }
}
#endif

// ----------------------------------------------------------------------------
/* timer interrupt */
void PS2_TIM_HANDLER(void)
{
  if(TIM_IRQ_GET)
  {
    #if (PS2_KBD_EXT_N >= 1) && (PS2_MOUSE_EXT_N >= 1)
    if(kbd.timermode)
      ps2_timer_int(&kbd);
    if(mouse.timermode)
      ps2_timer_int(&mouse);
    #elif PS2_KBD_EXT_N >= 1
    ps2_timer_int(&kbd);
    #elif PS2_MOUSE_EXT_N >= 1
    ps2_timer_int(&mouse);
    #endif
  }
  TIM_IRQ_CLR;
}

// ----------------------------------------------------------------------------
/* common ps2 low level init */
void ps2_init(void)
{
  #if (PS2_KBD_EXT_N >= 1) && (PS2_MOUSE_EXT_N >= 1)
  RCC_INIT;
  ps2_kbdinit();
  ps2_mouseinit();
  #elif PS2_KBD_EXT_N >= 1
  RCC_INIT;
  ps2_kbdinit();
  #elif PS2_MOUSE_EXT_N >= 1
  RCC_INIT;
  ps2_mouseinit();
  #endif

