RobertoBenjami/stm32_ps2/Drivers/ps2.c
  TIM_INIT;

  NVIC->ISER[(((uint32_t)(int32_t)PS2_TIM_IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)(int32_t)PS2_TIM_IRQn) & 0x1FUL));
  NVIC->IP[((uint32_t)(int32_t)PS2_TIM_IRQn)] = (uint8_t)((PS2_IRQPRIORITY << (8U - __NVIC_PRIO_BITS)) & (uint32_t)0xFFUL);
}

// ============================================================================
/* high level keyboard */
#if  PS2_KBD_EXT_N >= 1

/* get keyboard scan code
   - input
     *kbd_scan: scan code pointer (if NULL -> only return the key event information, and the RX fifo buffer not modified)
   - output
     return: 0 = not is key event, 1 = is key event
     *kbd_scan: keyboard scan code (if no key event occurred -> *kbd_scan not modified) */
uint8_t ps2_kbd_getscan(uint8_t * kbd_scan)
{
  ps2_initcheck();
  return ps2_kbd_dataread(kbd_scan);
}

// ----------------------------------------------------------------------------
/* Get keyboard asc code
   - input
     *kbd_key: asc code pointer (if NULL -> only return the key pressed information, and the RX fifo buffer not modified)
   - output
     return: 0 = no key pressed, 1 = key pressed
     *kbd_key: keyboard asc code (if no key event occurred -> *kbd_key not modified) */
uint8_t ps2_kbd_getkey(uint8_t * kbd_key)
{
  static uint8_t state = 0, ps2_kbd_c = 0, ps2_kbd_cs = 0;
  uint8_t ps2_kbd_s;

  ps2_initcheck();

  if(ps2_kbd_cs)
  { /* stored query (previous query: only key pressed information) */
    if(kbd_key)
    {
      *kbd_key = ps2_kbd_c;
      ps2_kbd_cs = 0;
    }
    return 1;
  }

  while(1)
  {
    if(ps2_kbd_dataread(&ps2_kbd_s) == 0)
    {
      return 0;                         /* nincs a billentyü pufferben semmi */
    }
    if(ps2_kbd_s == 0xE0)
    { /* két bájtos karakter */
      state |= ST_KBDMODIFIER;
      if(ps2_kbd_dataread(&ps2_kbd_s) == 0)
        return 0;
    }
    if(ps2_kbd_s == 0xF0)
    { /* gomb felengedés */
      state |= ST_KBDBREAK;
      if(ps2_kbd_dataread(&ps2_kbd_s) == 0)
        return 0;
    }

    if(state & ST_KBDBREAK)
    { /* gomb felengedés státusz */
      if(ps2_kbd_s == 0x12)
        state &= ~ST_KBDSHIFT_L;
      else if(ps2_kbd_s == 0x59)
        state &= ~ST_KBDSHIFT_R;
      else if(ps2_kbd_s == 0x14)
        state &= ~ST_KBDCTRL;
      else if(ps2_kbd_s == 0x11 && (state & ST_KBDMODIFIER))
        state &= ~ST_KBDALTGR;
      state &= ~(ST_KBDBREAK | ST_KBDMODIFIER); /* BREAK/MODIFIER státusz ki */
    }
    else
    {                                   /* gomb lenyomás vagy ismétlés */
      if(state & ST_KBDMODIFIER)
      {                                 /* két bájtos (MODIFIER) gombok (INS, DEL, 4 nyil stb.) */
        if(ps2_kbd_s == 0x11)
        {
          state |= ST_KBDALTGR;         /* E0 11 */
          continue;
        }
        else if(ps2_kbd_s == 0x14)
        {
          state |= ST_KBDCTRL;          /* E0 14 */
          continue;
        }
        switch(ps2_kbd_s)
        {
          case 0x70: ps2_kbd_c = PS2_INSERT;     break;
          case 0x6C: ps2_kbd_c = PS2_HOME;       break;
          case 0x7D: ps2_kbd_c = PS2_PAGEUP;     break;
          case 0x71: ps2_kbd_c = PS2_DELETE;     break;
          case 0x69: ps2_kbd_c = PS2_END;        break;
          case 0x7A: ps2_kbd_c = PS2_PAGEDOWN;   break;
          case 0x75: ps2_kbd_c = PS2_UPARROW;    break;
          case 0x6B: ps2_kbd_c = PS2_LEFTARROW;  break;
          case 0x72: ps2_kbd_c = PS2_DOWNARROW;  break;
          case 0x74: ps2_kbd_c = PS2_RIGHTARROW; break;
          case 0x4A: ps2_kbd_c = '/';            break;
          case 0x5A: ps2_kbd_c = PS2_ENTER;      break;
          default: break;
        }
        if(kbd_key)
        {
          *kbd_key = ps2_kbd_c;
        }
        else
        {
          ps2_kbd_cs = 1;
        }
        return 1;
      }
      else
      {                            /* nincs MODIFIER (egy bájtos kód) */
        if(ps2_kbd_s == 0x12)
        {
          state |= ST_KBDSHIFT_L;
          continue;
        }
        else if(ps2_kbd_s == 0x59)
        {
          state |= ST_KBDSHIFT_R;
          continue;
        }
        else if(ps2_kbd_s == 0x14)
        {
          state |= ST_KBDCTRL;
          continue;
        }
        if(ps2_kbd_s <= PS2_MAINKEYMAP_SIZE)
        {
          if((state & ST_KBDALTGR) && keymap.uses_altgr) /* altgr */
            ps2_kbd_c = keymap.altgr[ps2_kbd_s];
          else if(state & (ST_KBDSHIFT_L | ST_KBDSHIFT_R))
          { /* shift */
            if(ps2_kbdlockstatus & ST_KBDCAPSLOCK)
              ps2_kbd_c = keymap.shiftcaps[ps2_kbd_s];
            else
              ps2_kbd_c = keymap.shift[ps2_kbd_s];
          }
          else
          {
            if(ps2_kbdlockstatus & ST_KBDCAPSLOCK)
              ps2_kbd_c = keymap.noshiftcaps[ps2_kbd_s];
            else
              ps2_kbd_c = keymap.noshift[ps2_kbd_s];
          }
        }
        else if(ps2_kbd_s <= (PS2_MAINKEYMAP_SIZE + PS2_NUMKEYMAP_SIZE))
        { /* numerikus */
          if(ps2_kbdlockstatus & ST_KBDNUMLOCK)
            ps2_kbd_c = keymap.numon[ps2_kbd_s - PS2_MAINKEYMAP_SIZE];
          else
            ps2_kbd_c = keymap.numoff[ps2_kbd_s - PS2_MAINKEYMAP_SIZE];
        }
        if(kbd_key)
        {
          *kbd_key = ps2_kbd_c;
        }
        else
        {
          ps2_kbd_cs = 1;
        }
        return 1;
      } /* else (state & MODIFIER) */
    } /* else (state & BREAK) */
  } /*  while(1) */
}

// ----------------------------------------------------------------------------
uint8_t ps2_kbd_ledstatus(void)
{
  return ps2_kbdlockstatus;
}

// ----------------------------------------------------------------------------
uint8_t ps2_kbd_ctrlstatus(void)
{
  return ps2_kbdctrlstatus;
}

// ----------------------------------------------------------------------------
uint8_t ps2_kbd_setlocks(uint8_t kbd_locks)
{
  ps2_initcheck();
  ps2_kbdlockstatus = kbd_locks & 0x07;
  while(!ps2_kbd_datawrite(0xED));
  while(!ps2_kbd_datawrite(ps2_kbdlockstatus));
  return 1;
}

#else

uint8_t ps2_kbd_getscan(uint8_t * kbd_scan)  {return 0;}
uint8_t ps2_kbd_sendcmd(uint8_t kbd_command) {return 0;}
uint8_t ps2_kbd_getkey(uint8_t * kbd_key)    {return 0;}
uint8_t ps2_kbd_ledstatus(void)              {return 0;}

#endif

/* end of high level keyboard */
// ============================================================================
/* high level mouse */

