RobertoBenjami/stm32_ps2/Drivers/ps2.c
#if PS2_MOUSE_EXT_N >= 1

uint32_t          time_data_packet;     /* packet start time */
#if ((MOUSE_METHOD == 2) || (MOUSE_METHOD == 3))
uint32_t          time_now;             /* now time */
#endif

#define  MOUSE_UNINITIALIZATION   0     /* no connection the mouse or before reset */
#define  MOUSE_RESET              1     /* reset  */
#define  MOUSE_GETID              2     /* mouse ID */
#define  MOUSE_SETRATE_200        3     /* set rate */
#define  MOUSE_RATE_200           4     /* set rate */
#define  MOUSE_SETRATE_100        5     /* set rate */
#define  MOUSE_RATE_100           6     /* set rate */
#define  MOUSE_SETRATE_80         7     /* set rate */
#define  MOUSE_RATE_80            8     /* set rate */
#define  MOUSE_GETMOVE            9     /* move data read */
#define  MOUSE_ONDATAREPORT      10     /* mouse data report on */

// ----------------------------------------------------------------------------
/* read any bytes from mouse, timeout handled
   - param1: pointer to data array
   - param2: data array size,
   - param3: timeout value (msec)
   - return: 0 = timeout, 1 = no timeout but not arrived the pack, 2 = arrived the pack */
uint8_t ps2_mouse_readdatapacket(uint8_t * data8, uint32_t dsize, uint32_t timeout)
{
  #if MOUSE_METHOD == 1

  while(!(FIFO_LEN(mouserbuf) >= dsize))
  {
    if(PS2_GETTIME() - time_data_packet > timeout)
      return 0;
  }

  while(dsize--)
  {
    ps2_mouse_dataread(data8);
    data8++;
  }
  return 2;

  #elif ((MOUSE_METHOD == 2) || (MOUSE_METHOD == 3))
  uint8_t tmp8;
  if(FIFO_LEN(mouserbuf) >= dsize)
  {
    while(dsize--)
    {
      ps2_mouse_dataread(data8);
      data8++;
    }
    return 2;
  }
  else
  {
    if(time_now - time_data_packet > timeout)
    { /* timeout */
      while(ps2_mouse_dataread(&tmp8));/* receive buffer empty */
      return 0;
    }
    else
      return 1;
  }
  #endif
}

// ----------------------------------------------------------------------------
/* get mouse move */
uint8_t ps2_mouse_getmove(ps2_MouseData * mouse_data)
{
  static uint8_t    mouse_status = MOUSE_UNINITIALIZATION;
  static uint8_t    read_packet_size = 0;
  int16_t           tmp16;
  uint8_t           tmp8;

  ps2_initcheck();

  /* if not initialize a mouse */

  #if MOUSE_METHOD == 1
  uint8_t           data_packet[5];

  time_data_packet = PS2_GETTIME();
  if(mouse_status == MOUSE_GETMOVE)
  {
    ps2_mouse_datawrite(0xEB);            /* send the read data command */
    tmp8 = ps2_mouse_readdatapacket(data_packet, read_packet_size, PS2_MOUSE_READTIME);
    if(tmp8 == 2)
    { /* complett pack size */
      if(data_packet[0] != 0xFA)
      {
        return 0;
      }

      /* x move */
      if(data_packet[1] & 0x40)
        tmp16 = 256;
      else
        tmp16 = 0;
      tmp16 += data_packet[2];
      if(data_packet[1] & 0x10)
        tmp16 -= 256;
      mouse_data->xmove = tmp16;

      /* y move */
      if(data_packet[1] & 0x80)
        tmp16 = 256;
      else
        tmp16 = 0;
      tmp16 += data_packet[3];
      if(data_packet[1] & 0x20)
        tmp16 -= 256;
      mouse_data->ymove = tmp16;

      /* z move and buttons */
      if(read_packet_size == 4)
      { /* 3 byte mouse data size */
        mouse_data->zmove = 0;
        mouse_data->btns = data_packet[1] & 0x07;
      }
      else
      { /* 4 byte mouse data size */
        mouse_data->zmove = (int8_t)data_packet[4];
        mouse_data->btns = data_packet[1] & 0x07;
      }
      return 1;
    }
    else if(tmp8 == 0)
    {
      mouse_status = MOUSE_UNINITIALIZATION;
    }
  }

  else if(mouse_status == MOUSE_GETID)
  {
    ps2_mouse_datawrite(0xF2);      /* mouse ID */
    tmp8 = ps2_mouse_readdatapacket(data_packet, 2, PS2_MOUSE_IDTIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA) && ((data_packet[1] == 0x00) || (data_packet[1] == 0x03)))
    {
      mouse_status = MOUSE_GETMOVE;
      if(data_packet[1] == 0x00)
        read_packet_size = 4;
      else if(data_packet[1] == 0x03)
        read_packet_size = 5;
    }
  }

  else if((mouse_status >= MOUSE_SETRATE_200) && (mouse_status <= MOUSE_RATE_80))
  {
    if(mouse_status == MOUSE_RATE_200)
      ps2_mouse_datawrite(0xC8);        /* 200 */
    else if(mouse_status == MOUSE_RATE_100)
      ps2_mouse_datawrite(0x64);        /* 100 */
    else if(mouse_status == MOUSE_RATE_80)
      ps2_mouse_datawrite(0x50);        /* 80 */
    else
      ps2_mouse_datawrite(0xF3);        /* set sample rate */
    tmp8 = ps2_mouse_readdatapacket(data_packet, 1, PS2_MOUSE_RATETIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA))
    {
      if(mouse_status == MOUSE_RATE_80)
        mouse_status = MOUSE_GETID;
      else
        mouse_status++;
    }
    else
      mouse_status = MOUSE_UNINITIALIZATION;
  }

  else if(mouse_status == MOUSE_UNINITIALIZATION)
  {
    while(ps2_mouse_dataread(&tmp8));   /* receive buffer empty */
    ps2_mouse_datawrite(0xFF);          /* mouse reset */
    tmp8 = ps2_mouse_readdatapacket(data_packet, 3, PS2_MOUSE_RESETTIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA) && (data_packet[1] == 0xAA) && (data_packet[2] == 0x00))
      mouse_status = MOUSE_SETRATE_200;
  }

  return 0;

  #elif MOUSE_METHOD == 2

  uint8_t           data_packet[5];

  time_now = PS2_GETTIME();
  if(mouse_status == MOUSE_GETMOVE)
  {
    tmp8 = ps2_mouse_readdatapacket(data_packet, read_packet_size, PS2_MOUSE_READTIME);
    if(tmp8 == 2)
    { /* complett pack size */
      if(data_packet[0] != 0xFA)
      {
        return 0;
      }

      /* x move */
      if(data_packet[1] & 0x40)
        tmp16 = 256;
      else
        tmp16 = 0;
      tmp16 += data_packet[2];
      if(data_packet[1] & 0x10)
        tmp16 -= 256;
      mouse_data->xmove = tmp16;

      /* y move */
      if(data_packet[1] & 0x80)
        tmp16 = 256;
      else
        tmp16 = 0;
      tmp16 += data_packet[3];
      if(data_packet[1] & 0x20)
        tmp16 -= 256;
      mouse_data->ymove = tmp16;

      /* z move and buttons */
      if(read_packet_size == 4)
      { /* 3 byte mouse data size */
        mouse_data->zmove = 0;
        mouse_data->btns = data_packet[1] & 0x07;
      }
      else
      { /* 4 byte mouse data size */
        mouse_data->zmove = (int8_t)data_packet[4];
        mouse_data->btns = data_packet[1] & 0x07;
      }
      ps2_mouse_datawrite(0xEB);        /* send the read data command */
      time_data_packet = time_now;
      return 1;
    }
    else if(tmp8 == 0)
    {
      mouse_status = MOUSE_UNINITIALIZATION;
    }
  }

  else if(mouse_status == MOUSE_GETID)
  {
    tmp8 = ps2_mouse_readdatapacket(data_packet, 2, PS2_MOUSE_IDTIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA) && ((data_packet[1] == 0x00) || (data_packet[1] == 0x03)))
    { /* FA 00 or FA 03 */
      ps2_mouse_datawrite(0xEB);            /* send the read data command */
      time_data_packet = time_now;
      mouse_status = MOUSE_GETMOVE;
      if(data_packet[1] == 0x00)
        read_packet_size = 4;
      else if(data_packet[1] == 0x03)
        read_packet_size = 5;
    }
    else
      mouse_status = MOUSE_UNINITIALIZATION;
  }

  else if((mouse_status >= MOUSE_SETRATE_200) && (mouse_status <= MOUSE_RATE_80))
  {
    tmp8 = ps2_mouse_readdatapacket(data_packet, 1, PS2_MOUSE_RATETIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA))
    {
      if(mouse_status < MOUSE_RATE_80)
      {
        mouse_status++;
        if(mouse_status == MOUSE_RATE_200)
          ps2_mouse_datawrite(0xC8);    /* 200 */
        else if(mouse_status == MOUSE_RATE_100)
          ps2_mouse_datawrite(0x64);    /* 100 */
        else if(mouse_status == MOUSE_RATE_80)
          ps2_mouse_datawrite(0x50);    /* 80 */
        else
          ps2_mouse_datawrite(0xF3);    /* set sample rate */
      }
      else
      {
        ps2_mouse_datawrite(0xF2);      /* mouse ID */
        mouse_status = MOUSE_GETID;
      }
      time_data_packet = time_now;
    }
    else
      mouse_status = MOUSE_UNINITIALIZATION;
  }

  else if(mouse_status == MOUSE_RESET)
  {
    tmp8 = ps2_mouse_readdatapacket(data_packet, 3, PS2_MOUSE_RESETTIME);
    if(tmp8 == 2)
    {
      if((data_packet[0] == 0xFA) && (data_packet[1] == 0xAA) && (data_packet[2] == 0x00))
      {
        ps2_mouse_datawrite(0xF3);      /* set sample rate */
        time_data_packet = time_now;
        mouse_status = MOUSE_SETRATE_200;
      }
    }
    else if(tmp8 == 0)
    {
      mouse_status = MOUSE_UNINITIALIZATION;
    }
  }

  else if(mouse_status == MOUSE_UNINITIALIZATION)
  {
    while(ps2_mouse_dataread(&tmp8));   /* receive buffer empty */
    ps2_mouse_datawrite(0xFF);          /* mouse reset */
    time_data_packet = time_now;
    mouse_status = MOUSE_RESET;
    ps2_printf("mouse reset\r\n");
  }

