RobertoBenjami/stm32_ps2/Drivers/ps2.c
  return 0;

  #elif MOUSE_METHOD == 3

  static uint8_t    pre_mouse_buttons;
  uint32_t fifo_len;
  uint8_t           data_packet[4];

  time_now = PS2_GETTIME();
  if(mouse_status == MOUSE_GETMOVE)
  {
    fifo_len = FIFO_LEN(mouserbuf);
    if(fifo_len >= read_packet_size)
    { /* complett pack size */
      mouse_data->xmove = 0;
      mouse_data->ymove = 0;
      mouse_data->zmove = 0;
      mouse_data->btns  = 0;
      while(1)
      {
        ps2_mouse_dataread(&data_packet[0]);
        ps2_mouse_dataread(&data_packet[1]);
        ps2_mouse_dataread(&data_packet[2]);

        /* x move */
        if(data_packet[0] & 0x40)
          tmp16 = 256;
        else
          tmp16 = 0;
        tmp16 += data_packet[1];
        if(data_packet[0] & 0x10)
          tmp16 -= 256;
        mouse_data->xmove += tmp16;

        /* y move */
        if(data_packet[0] & 0x80)
          tmp16 = 256;
        else
          tmp16 = 0;
        tmp16 += data_packet[2];
        if(data_packet[0] & 0x20)
          tmp16 -= 256;
        mouse_data->ymove += tmp16;

        /* z move and buttons */
        if(read_packet_size == 3)
        { /* 3 byte mouse data size */
          mouse_data->zmove = 0;
          mouse_data->btns = data_packet[0] & 0x07;
        }
        else
        { /* 4 byte mouse data size */
          ps2_mouse_dataread(&data_packet[3]);
          mouse_data->zmove += (int8_t)data_packet[3];
          mouse_data->btns = data_packet[0] & 0x07;
        }

        if((FIFO_LEN(mouserbuf) < read_packet_size) || mouse_data->btns != pre_mouse_buttons)
        {
          pre_mouse_buttons = mouse_data->btns;
          time_data_packet = time_now;
          return 1;
        }
      }
    }
    else
    {
      if(fifo_len)
      {
        if(time_now - time_data_packet > PS2_MOUSE_READTIME)
          while(ps2_mouse_dataread(&tmp8)); /* receive buffer empty */
      }
      else
        time_data_packet = time_now;
    }
  }

  else if(mouse_status == MOUSE_ONDATAREPORT)
  {
    tmp8 = ps2_mouse_readdatapacket((uint8_t *)&data_packet, 1, PS2_MOUSE_IDTIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA))
    {
      time_data_packet = time_now;
      mouse_status = MOUSE_GETMOVE;
    }
    else
      mouse_status = MOUSE_UNINITIALIZATION;
  }

  else if(mouse_status == MOUSE_GETID)
  {
    tmp8 = ps2_mouse_readdatapacket((uint8_t *)&data_packet, 2, PS2_MOUSE_IDTIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA) && ((data_packet[1] == 0x00) || (data_packet[1] == 0x03)))
    { /* FA 00 or FA 03 */
      ps2_mouse_datawrite(0xF4);            /* enable data reporting */
      time_data_packet = time_now;
      mouse_status = MOUSE_ONDATAREPORT;
      if(data_packet[1] == 0x00)
        read_packet_size = 3;
      else if(data_packet[1] == 0x03)
        read_packet_size = 4;
    }
    else
      mouse_status = MOUSE_UNINITIALIZATION;
  }

  else if((mouse_status >= MOUSE_SETRATE_200) && (mouse_status <= MOUSE_RATE_80))
  {
    tmp8 = ps2_mouse_readdatapacket((uint8_t *)&data_packet, 1, PS2_MOUSE_RATETIME);
    if((tmp8 == 2) && (data_packet[0] == 0xFA))
    {
      if(mouse_status < MOUSE_RATE_80)
      {
        mouse_status++;
        if(mouse_status == MOUSE_RATE_200)
          ps2_mouse_datawrite(0xC8);    /* 200 */
        else if(mouse_status == MOUSE_RATE_100)
          ps2_mouse_datawrite(0x64);    /* 100 */
        else if(mouse_status == MOUSE_RATE_80)
          ps2_mouse_datawrite(0x50);    /* 80 */
        else
          ps2_mouse_datawrite(0xF3);    /* set sample rate */
      }
      else
      {
        ps2_mouse_datawrite(0xF2);      /* mouse ID */
        mouse_status = MOUSE_GETID;
      }
      time_data_packet = time_now;
    }
    else
      mouse_status = MOUSE_UNINITIALIZATION;
  }

  else if(mouse_status == MOUSE_RESET)
  {
    tmp8 = ps2_mouse_readdatapacket((uint8_t *)&data_packet, 3, PS2_MOUSE_RESETTIME);
    if(tmp8 == 2)
    {
      if((data_packet[0] == 0xFA) && (data_packet[1] == 0xAA) && (data_packet[2] == 0x00))
      {
        ps2_mouse_datawrite(0xF3);      /* set sample rate */
        time_data_packet = time_now;
        mouse_status = MOUSE_SETRATE_200;
      }
    }
    else if(tmp8 == 0)
    {
      mouse_status = MOUSE_UNINITIALIZATION;
    }
  }

  else if(mouse_status == MOUSE_UNINITIALIZATION)
  {
    while(ps2_mouse_dataread(&tmp8));   /* receive buffer empty */
    ps2_mouse_datawrite(0xFF);          /* mouse reset */
    time_data_packet = time_now;
    mouse_status = MOUSE_RESET;
    ps2_printf("mouse reset\r\n");
  }

  return 0;

  #endif
}

#else

uint8_t ps2_mouse_getmove(ps2_MouseData * mouse_data) {return 0;}

#endif
